---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ViewNavigationToolSettings
source: html/82db9c15-20e5-cac0-201c-c7912abf5bc9.htm
---
# ViewNavigationToolSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.